// #3ckURgvs

// – Дано змінну time яка рівна числу від 0 до 60. Потрібно написати код, який перевірить, до якої четверті години попадає число

// (в першу, другу, третю або четверту частину години).

let time = +prompt('Введіть цифру від 0 до 60');

if (time >= 0 && time <= 60 * (1 / 4)) {
	console.log('перша чверть години');
} else if (time <= 60 * (1 / 2) && time > 60 * (1 / 4)) {
	console.log('друга чверть години');

} else if (time <= (60 * (3 / 4)) && time > (60 * (1 / 2))) {
	console.log('третя чверть години');

} else if (time >= (60 * (3 / 4)) && time < 60) {
	console.log('четверта чверть години');
}